# 데이터프레임 합성

In [1]:
import numpy as np
import pandas as pd

## merge

In [2]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [3]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [4]:
# df1과 df2의 고객번호가 일치함 merge를 통해 합치기
# 공집합의 data를 가져오기: Inner Join
# A, B 두 집합이 공집합이고 A의 모든data(공집합 포함)를 'Left Outer Join'
# A, B 두 집합이 공집합이고 B의 모든data(공집합 포함)를 'Right Outer Join'
# A, B 두 집합이 공집합이고 그의 합집합은 'Full Outer Join'

In [5]:
# Inner join
pd.merge(df1, df2)      # how = 'inner'

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [6]:
# Left Outer Join
pd.merge(df1, df2, how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [9]:
# Right outer join
pd.merge(df1, df2, how='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1001   둘리   30000
3  1005   희동   15000
4  1006  마이콜    5000
5  1008  NaN  100000

In [10]:
# Full outer join
pd.merge(df1, df2, how='outer')

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

### 동일한 컬럼이 있는 경우

In [19]:
df1 = pd.DataFrame({
    '고객명': ['춘향', '춘향', '몽룡'],
    '날짜': ['2018-01-01', '2018-01-02', '2018-01-01'],
    '데이터': ['20000', '30000', '100000']})
df1

  고객명          날짜     데이터
0  춘향  2018-01-01   20000
1  춘향  2018-01-02   30000
2  몽룡  2018-01-01  100000

In [20]:
df2 = pd.DataFrame({
    '고객명': ['춘향', '몽룡'],
    '데이터': ['여자', '남자']})
df2

  고객명 데이터
0  춘향  여자
1  몽룡  남자

In [21]:
pd.merge(df1, df2, on='고객명')

  고객명          날짜   데이터_x 데이터_y
0  춘향  2018-01-01   20000    여자
1  춘향  2018-01-02   30000    여자
2  몽룡  2018-01-01  100000    남자

### 동일한 컬럼이 없는 경우

In [22]:
df1 = pd.DataFrame({
    '이름': ['영희', '철수', '철수'],
    '성적': [1, 2, 3]})
df1

   이름  성적
0  영희   1
1  철수   2
2  철수   3

In [23]:
df2 = pd.DataFrame({
    '성명': ['영희', '영희', '철수'],
    '성적2': [4, 5, 6]})
df2

   성명  성적2
0  영희    4
1  영희    5
2  철수    6

In [24]:
pd.merge(df1, df2, left_on='이름', right_on="성명")

   이름  성적  성명  성적2
0  영희   1  영희    4
1  영희   1  영희    5
2  철수   2  철수    6
3  철수   3  철수    6

## join method

In [30]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1.set_index('고객번호', inplace=True)
df1

       이름
고객번호
1001   둘리
1002  도우너
1003   또치
1004   길동
1005   희동
1006  마이콜
1007   영희

In [31]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2.set_index('고객번호', inplace=True)
df2

          금액
고객번호
1001   10000
1001   20000
1005   15000
1006    5000
1008  100000
1001   30000

In [29]:
# join을 사용하려면 key 값이 같아야함
# df1에 df1.set_index('고객번호', inplace=True)
# df2에 df2.set_index('고객번호', inplace=True)
df1.join(df2, how='inner')

ValueError: ignored

In [32]:
df1.join(df2, how='inner')

       이름     금액
고객번호
1001   둘리  10000
1001   둘리  20000
1001   둘리  30000
1005   희동  15000
1006  마이콜   5000

In [33]:
df1.join(df2)       # how에 아무 지정을 해주지않으면 기본적으로 inner

       이름       금액
고객번호
1001   둘리  10000.0
1001   둘리  20000.0
1001   둘리  30000.0
1002  도우너      NaN
1003   또치      NaN
1004   길동      NaN
1005   희동  15000.0
1006  마이콜   5000.0
1007   영희      NaN

## concat 함수

In [34]:
s1 = pd.Series([0, 1], index=['A', 'B'])
s1

A    0
B    1
dtype: int64

In [36]:
s2 = pd.Series([2, 3, 4], index=['A', 'B', 'C'])
s2

A    2
B    3
C    4
dtype: int64

In [37]:
pd.concat([s1, s2])

A    0
B    1
A    2
B    3
C    4
dtype: int64

In [38]:
df1 = pd.DataFrame(
    np.arange(6).reshape(3, 2),
    index=['a', 'b', 'c'],
    columns=['데이터1', '데이터2'])
df1

   데이터1  데이터2
a     0     1
b     2     3
c     4     5

In [39]:
df2 = pd.DataFrame(
    5 + np.arange(4).reshape(2, 2),
    index=['a', 'c'],
    columns=['데이터3', '데이터4'])
df2

   데이터3  데이터4
a     5     6
c     7     8

In [40]:
pd.concat([df1, df2], axis=1)

   데이터1  데이터2  데이터3  데이터4
a     0     1   5.0   6.0
b     2     3   NaN   NaN
c     4     5   7.0   8.0

### 연습문제
- 어느 회사의 전반기(1월 ~ 6월) 실적을 나타내는 데이터프레임과 후발기(7월 ~ 12월)실적을 나타내는 데이터프레임을 만든 뒤 합친다.
- 실적 정보는 "매출", "비용", "이익"으로 이루어진다.
- (이익 = 매출 - 비용)
- 또한 1년 간의 총 실적을 마지막 행으로 덧붙인다.

In [54]:
df1 = pd.DataFrame(np.random.randint(100, 1000, size=(6, 2)),
                   columns=['매출', '비용'],
                   index=['1월', '2월', '3월', '4월', '5월', '6월'])
df1['이익'] = df1.매출 - df1.비용
df1

     매출   비용   이익
1월  681  758  -77
2월  467  223  244
3월  593  721 -128
4월  827  329  498
5월  576  643  -67
6월  988  814  174

In [55]:
df2 = pd.DataFrame(np.random.randint(100, 1000, size=(6, 2)),
                   columns=['매출', '비용'],
                   index=['7월', '8월', '9월', '10월', '11월', '12월'])
df2['이익'] = df2.매출 - df2.비용
df2

      매출   비용   이익
7월   971  601  370
8월   658  255  403
9월   633  381  252
10월  534  906 -372
11월  545  556  -11
12월  479  610 -131

In [56]:
df = pd.concat([df1, df2])
df

      매출   비용   이익
1월   681  758  -77
2월   467  223  244
3월   593  721 -128
4월   827  329  498
5월   576  643  -67
6월   988  814  174
7월   971  601  370
8월   658  255  403
9월   633  381  252
10월  534  906 -372
11월  545  556  -11
12월  479  610 -131

In [57]:
df.sum()

매출    7952
비용    6797
이익    1155
dtype: int64

In [58]:
tdf = pd.DataFrame(df.sum()).T
tdf

     매출    비용    이익
0  7952  6797  1155

In [59]:
tdf.index = ['합계']
tdf

      매출    비용    이익
합계  7952  6797  1155

In [60]:
df = pd.concat([df, tdf])
df

       매출    비용    이익
1월    681   758   -77
2월    467   223   244
3월    593   721  -128
4월    827   329   498
5월    576   643   -67
6월    988   814   174
7월    971   601   370
8월    658   255   403
9월    633   381   252
10월   534   906  -372
11월   545   556   -11
12월   479   610  -131
합계   7952  6797  1155